{
  "_class_name": "LongCatAudioDiTPipeline",
  "_diffusers_version": "0.38.0.dev0",
  "scheduler": [
    "diffusers",
    "FlowMatchEulerDiscreteScheduler"
  ],
  "text_encoder": [
    "transformers",
    "UMT5EncoderModel"
  ],
  "tokenizer": [
    "transformers",
    "T5TokenizerFast"
  ],
  "transformer": [
    "diffusers",
    "LongCatAudioDiTTransformer"
  ],
  "vae": [
    "diffusers",
    "LongCatAudioDiTVae"
  ]
}
