{
  "_class_name": "AceStepTransformer1DModel",
  "_diffusers_version": "0.38.0.dev0",
  "attention_bias": false,
  "attention_dropout": 0.0,
  "audio_acoustic_hidden_dim": 64,
  "encoder_hidden_size": 2048,
  "head_dim": 128,
  "hidden_size": 2048,
  "in_channels": 192,
  "intermediate_size": 6144,
  "is_turbo": true,
  "layer_types": [
    "sliding_attention",
    "full_attention",
    "sliding_attention",
    "full_attention",
    "sliding_attention",
    "full_attention",
    "sliding_attention",
    "full_attention",
    "sliding_attention",
    "full_attention",
    "sliding_attention",
    "full_attention",
    "sliding_attention",
    "full_attention",
    "sliding_attention",
    "full_attention",
    "sliding_attention",
    "full_attention",
    "sliding_attention",
    "full_attention",
    "sliding_attention",
    "full_attention",
    "sliding_attention",
    "full_attention"
  ],
  "model_version": "turbo",
  "num_attention_heads": 16,
  "num_hidden_layers": 24,
  "num_key_value_heads": 8,
  "patch_size": 2,
  "rms_norm_eps": 1e-06,
  "rope_theta": 1000000,
  "sliding_window": 128
}
