{
  "_class_name": "AceStepConditionEncoder",
  "_diffusers_version": "0.38.0.dev0",
  "attention_bias": false,
  "attention_dropout": 0.0,
  "head_dim": 128,
  "hidden_size": 2048,
  "intermediate_size": 6144,
  "layer_types": null,
  "num_attention_heads": 16,
  "num_key_value_heads": 8,
  "num_lyric_encoder_hidden_layers": 8,
  "num_timbre_encoder_hidden_layers": 4,
  "rms_norm_eps": 1e-06,
  "rope_theta": 1000000,
  "sliding_window": 128,
  "text_hidden_dim": 1024,
  "timbre_hidden_dim": 64
}
