{
  "architectures": [
    "GlmImageForConditionalGeneration"
  ],
  "image_start_token_id": 16384,
  "image_end_token_id": 16385,
  "image_token_id": 167855,
  "model_type": "glm_image",
  "text_config": {
    "attention_dropout": 0.0,
    "eos_token_id": 16385,
    "pad_token_id": 167841,
    "hidden_act": "silu",
    "hidden_size": 4096,
    "initializer_range": 0.02,
    "intermediate_size": 13696,
    "max_position_embeddings": 131072,
    "model_type": "glm_image_text",
    "num_attention_heads": 32,
    "num_hidden_layers": 40,
    "num_key_value_heads": 2,
    "rms_norm_eps": 1e-05,
    "dtype": "bfloat16",
    "rope_parameters": {
      "rope_theta": 10000,
      "rope_type": "default",
      "mrope_section": [
        8,
        12,
        12
      ],
      "partial_rotary_factor": 0.5
    },
    "use_cache": true,
    "vision_vocab_size": 16512,
    "vocab_size": 168064
  },
  "transformers_version": "5.0.0.dev0",
  "vision_config": {
    "attention_bias": true,
    "attention_dropout": 0.0,
    "depth": 40,
    "hidden_act": "gelu",
    "hidden_size": 1536,
    "image_size": 2048,
    "in_channels": 3,
    "intermediate_size": 6144,
    "layer_norm_eps": 1e-06,
    "model_type": "glm_image_vision",
    "num_heads": 16,
    "patch_size": 16
  },
  "vq_config": {
    "embed_dim": 2048,
    "in_channels": 3,
    "initializer_range": 0.02,
    "latent_channels": 1536,
    "model_type": "glm_image_vqmodel",
    "num_embeddings": 16384
  }
}
