{
  "_class_name": "AceStepAudioTokenDetokenizer",
  "_diffusers_version": "0.38.0.dev0",
  "attention_bias": false,
  "attention_dropout": 0.0,
  "audio_acoustic_hidden_dim": 64,
  "head_dim": 128,
  "hidden_size": 2048,
  "intermediate_size": 6144,
  "layer_types": [
    "sliding_attention",
    "full_attention"
  ],
  "num_attention_heads": 16,
  "num_attention_pooler_hidden_layers": 2,
  "num_key_value_heads": 8,
  "pool_window_size": 5,
  "rms_norm_eps": 1e-06,
  "rope_theta": 1000000,
  "sliding_window": 128
}
